In [9]:
import pandas as pd
import numpy as np

# Creando un DataFrame

In [10]:
df = pd.read_csv('./mastermind.csv', index_col=[0])

In [11]:
df

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    30   130855    H
1     Sara Nogark     Edición de vídeo    29   114175    M
2    Nate Gentile         Programación    31   142545    H
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

In [13]:
datos = {'nombre': list(df['nombre']), 'especialidad': list(df['especialidad']), 'edad': [np.random.randint(24, 31) for i in range(len(df['nombre']))], 
        'visitas': [np.random.randint(24, 31000) for i in range(len(df['nombre']))]}

In [14]:
datos

{'nombre': ['SFDX Show',
  'Sara Nogark',
  'Nate Gentile',
  'Bettatech',
  'Antonio Sarosi',
  'Edgar Pons',
  's4vitar'],
 'especialidad': ['Hardware',
  'Edición de vídeo',
  'Programación',
  'Programación',
  'Sistemas Operativos',
  'Robótica',
  'Hacking'],
 'edad': [29, 30, 28, 27, 29, 27, 24],
 'visitas': [804, 15409, 21845, 13024, 4408, 24709, 21810]}

In [16]:
df_inventado = pd.DataFrame(datos)
df_inventado

           nombre         especialidad  edad  visitas
0       SFDX Show             Hardware    29      804
1     Sara Nogark     Edición de vídeo    30    15409
2    Nate Gentile         Programación    28    21845
3       Bettatech         Programación    27    13024
4  Antonio Sarosi  Sistemas Operativos    29     4408
5      Edgar Pons             Robótica    27    24709
6         s4vitar              Hacking    24    21810

In [19]:
df_inventado['sexo'] = ['H', 'H', 'M', 'H', 'H', 'M', 'H']

In [20]:
df_inventado

           nombre         especialidad  edad  visitas sexo
0       SFDX Show             Hardware    29      804    H
1     Sara Nogark     Edición de vídeo    30    15409    H
2    Nate Gentile         Programación    28    21845    M
3       Bettatech         Programación    27    13024    H
4  Antonio Sarosi  Sistemas Operativos    29     4408    H
5      Edgar Pons             Robótica    27    24709    M
6         s4vitar              Hacking    24    21810    H

# Explorando un DataFrame

## df.head()

In [24]:
df.head(3)

         nombre      especialidad  edad  visitas sexo
0     SFDX Show          Hardware    30   130855    H
1   Sara Nogark  Edición de vídeo    29   114175    M
2  Nate Gentile      Programación    31   142545    H

## df.tail()

In [26]:
df.tail(4)

           nombre         especialidad  edad  visitas sexo
3       Bettatech         Programación    31   149462    H
4  Antonio Sarosi  Sistemas Operativos    28   132008    H
5      Edgar Pons             Robótica    29   143620    H
6         s4vitar              Hacking    28   132567    H

## df.sample()

In [28]:
df.sample(2)

         nombre  especialidad  edad  visitas sexo
5    Edgar Pons      Robótica    29   143620    H
2  Nate Gentile  Programación    31   142545    H

## df.info()

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   nombre        7 non-null      object
 1   especialidad  7 non-null      object
 2   edad          7 non-null      int64
 3   visitas       7 non-null      int64
 4   sexo          7 non-null      object
dtypes: int64(2), object(3)
memory usage: 336.0+ bytes

## df.describe()

In [31]:
df.describe()

            edad        visitas
count   7.000000       7.000000
mean   29.428571  135033.142857
std     1.272418   11590.990631
min    28.000000  114175.000000
25%    28.500000  131431.500000
50%    29.000000  132567.000000
75%    30.500000  143082.500000
max    31.000000  149462.000000

## df.shape

In [32]:
df.shape

(7, 5)

## df.columns

In [34]:
df.columns = ['nombre', 'especialidad', 'viejo', 'visitas', 'sexo']

In [35]:
df

           nombre         especialidad  viejo  visitas sexo
0       SFDX Show             Hardware     30   130855    H
1     Sara Nogark     Edición de vídeo     29   114175    M
2    Nate Gentile         Programación     31   142545    H
3       Bettatech         Programación     31   149462    H
4  Antonio Sarosi  Sistemas Operativos     28   132008    H
5      Edgar Pons             Robótica     29   143620    H
6         s4vitar              Hacking     28   132567    H

## df.index

In [36]:
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

# Seleccion de elementos (Subset)

## Acceso mediante etiquetas

In [38]:
df.head()

           nombre         especialidad  viejo  visitas sexo
0       SFDX Show             Hardware     30   130855    H
1     Sara Nogark     Edición de vídeo     29   114175    M
2    Nate Gentile         Programación     31   142545    H
3       Bettatech         Programación     31   149462    H
4  Antonio Sarosi  Sistemas Operativos     28   132008    H

In [45]:
df[df['nombre'] == 'Nate Gentile']['especialidad']

2    Programación
Name: especialidad, dtype: object

In [48]:
mas_viejos = df[df['viejo']==29]['nombre']

## df.iloc[]

In [50]:
df.iloc[3,2]

31

In [52]:
df.iloc[2,0:2]

nombre          Nate Gentile
especialidad    Programación
Name: 2, dtype: object

## df.loc()

In [55]:
df.loc[2, ['especialidad','visitas']]

especialidad    Programación
visitas               142545
Name: 2, dtype: object

# Manipulacion de Datos

## Cambiar indice

### df.set_index()

In [58]:
df.set_index('nombre', inplace=True)

In [59]:
df

                       especialidad  viejo  visitas sexo
nombre
SFDX Show                  Hardware     30   130855    H
Sara Nogark        Edición de vídeo     29   114175    M
Nate Gentile           Programación     31   142545    H
Bettatech              Programación     31   149462    H
Antonio Sarosi  Sistemas Operativos     28   132008    H
Edgar Pons                 Robótica     29   143620    H
s4vitar                     Hacking     28   132567    H

In [60]:
df.reset_index()

           nombre         especialidad  viejo  visitas sexo
0       SFDX Show             Hardware     30   130855    H
1     Sara Nogark     Edición de vídeo     29   114175    M
2    Nate Gentile         Programación     31   142545    H
3       Bettatech         Programación     31   149462    H
4  Antonio Sarosi  Sistemas Operativos     28   132008    H
5      Edgar Pons             Robótica     29   143620    H
6         s4vitar              Hacking     28   132567    H